Revit 2026 API

# PartUtilsGetPartMakerMethodToDivideVolumeFW Method

---

Obtains the object allowing access to the divided volume properties of the PartMaker.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PartMakerMethodToDivideVolumes GetPartMakerMethodToDivideVolumeFW(
	PartMaker partMaker
)
```
```vb
Public Shared Function GetPartMakerMethodToDivideVolumeFW (
	partMaker As PartMaker
) As PartMakerMethodToDivideVolumes
```
```cpp
public:
static PartMakerMethodToDivideVolumes^ GetPartMakerMethodToDivideVolumeFW(
	PartMaker^ partMaker
)
```
```fsharp
static member GetPartMakerMethodToDivideVolumeFW :
        partMaker : PartMaker -> PartMakerMethodToDivideVolumes
```

#### Parameters

partMaker PartMaker
     The PartMaker.

#### Return Value

PartMakerMethodToDivideVolumes The object handle. Returns  if the PartMaker does not represent divided volumes.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PartUtils Class

Autodesk.Revit.DB Namespace